In [1]:
import pandas as pd

# AÃ±adimos un diccionario

In [15]:
example_data = {'Name': ['Ana', 'Carlos', 'Luis', None, 'Ana'],
         'Age': [23, 35, None, 40, 23],
         'City': ['Lima', 'Arequipa', 'Cusco', 'Lima', 'Lima']}

In [16]:
df = pd.DataFrame(example_data)
df

     Name   Age      City
0     Ana  23.0      Lima
1  Carlos  35.0  Arequipa
2    Luis   NaN     Cusco
3    None  40.0      Lima
4     Ana  23.0      Lima

In [18]:
for index,row in df.iterrows():
    print(row["Name"])

Ana
Carlos
Luis
None
Ana